wuhuaha/realtime-voice-agent/firmware/apps/voice_terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_MEMTEST=n
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
# Full-duplex voice sends uplink audio while TTS frames arrive. Keep TX
# serialization independent from the client's receive/state lock.
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_RVA_ENABLE_UI=y
# A conversation is an explicit user-owned lifecycle. Keeping the network and
# UI ready while idle avoids occupying a worker lease until MIC is pressed.
# CONFIG_RVA_AUTO_START_CONVERSATION is not set
CONFIG_RVA_MIC_BUTTON_CONTROLS_SESSION=y
CONFIG_RVA_DEFAULT_MEDIA_PROFILE_WSS=y
# CONFIG_RVA_DEFAULT_MEDIA_PROFILE_UDP is not set
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9S_HIESP=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
